frontend/controllers/SiteController.php

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 1| Create session', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 1| Create session';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 2| Загрузить данные сессии', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 2| Загрузить данные сессии';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 3| Загрузить данные ЭЦП', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 3| Загрузить данные ЭЦП';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 4| Установить параметры сессии', '{\"embedCertificateType\" : \"signerCert\"}', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 4| Установить параметры сессии';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 5| Проверить ЭЦП', NULL, '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 5| Проверить ЭЦП';
		$TestData->response_string = $last_line;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 6| Получить подписанные документы', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 6| Получить подписанные документы';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 5| Проверить ЭЦП', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 5| Проверить ЭЦП';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();

INSERT INTO `testdata` (`user`, `session_counter`, `session_cipher`, `request_string`, `response_string`, `data`) VALUES ('IT Specialist', 0, 'No session created', 'Step 7| Delete session', '', '2020-12-21 15:47:10')
---
		$TestData->request_string = 'Step 7| Delete session';
		$TestData->response_string = $response->content;
		$TestData->data = $date->format('Y-m-d H:i:s');
		$TestData->save();